InformationRegisters/НастройкиСбораГрафиковОтпусковКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСбораГрафиковОтпусковКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешитьОтпускНеПланирую</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СхемаПредставленияПодразделений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СхемыПредставленияПодразделенийСбораГрафиковОтпусков</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СхемыПредставленияПодразделенийСбораГрафиковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СхемыПредставленияПодразделенийСбораГрафиковОтпусков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НепосредственныеПодчиненные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключаяНижестоящиеПодразделения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиСбораГрафиковОтпусковКабинетСотрудника/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Настройки() Экспорт
	
	Настройки = РегистрыСведений.НастройкиСбораГрафиковОтпусковКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиСбораГрафиковОтпусковКабинетСотрудника);
							
	СтруктураНастроек.Вставить("ПланированиеОтпусковПоНорме", 		Истина);
	СтруктураНастроек.Вставить("КомпенсацияДополнительныхОтпусков", Ложь);
	СтруктураНастроек.Вставить("ПроверятьПланирование14ДнейОтпуска", Ложь);
	Если Не ЗначениеЗаполнено(СтруктураНастроек.СхемаПредставленияПодразделений) Тогда
		СтруктураНастроек.СхемаПредставленияПодразделений = Перечисления.СхемыПредставленияПодразделенийСбораГрафиковОтпусков.НепосредственныеПодчиненные;
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

// Сохранить новые настройки.
// 
// Параметры:
//  СохраняемыеНастройки - см. ОписаниеНастроек
Процедура СохранитьНовыеНастройки(СохраняемыеНастройки, Источник = Неопределено) Экспорт

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СохраняемыеНастройки);
	Иначе
		ЗаполнитьЗначенияСвойств(НаборЗаписей[0], СохраняемыеНастройки);
	КонецЕсли;
	НаборЗаписей.Записать();
	
	ИнтеграцияУправлениеПерсоналомСобытияРасширенный.ПриЗаписиНастроекСбораГрафиковОтпусков(Источник);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
